# XCoordinate

## Description
Returns the X coordinate of the object relative to the user origin.

```pascal
FUNCTION XCoordinate(c : CRITERIA) : REAL;
```

```python

def vs.XCoordinate(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|The search criteria string.|

## Version
Availability: from Vectorworks 2011
## Category
* Criteria